import React from 'react';
import qubie from '@assets/explore/qubieIcon.png'
import princess from '@assets/explore/chapter5/princessIcon.png'
import {F0,F1,F2,F3,F4,F5} from './Frame'
import IntroTemplate from '../../Template/IntroTemplate'

class Intro extends React.Component {

    componentWillReceiveProps = () => {
        this.forceUpdate();
    }

    render() {
        return (
                <IntroTemplate
                    chapter={5}
                    unit={0}
                    frameComponent={[F0,F1,F2,F2,F3,F4,F5,F5,F5]}
                    script={[
                        ``,
                        `ไม่คิดเลยว่าทุกอย่างจะพาฉันกลับมาที่นี่อีกครั้ง... ที่นี่คือปราสาทแห่งความรู้ ศูนย์กลางของดินแดนภูติ`,
                        `ตลอดเวลาที่ผ่านมา ทหารองครักษ์มากมายคอยปกปักรักษาที่แห่งนี้ แต่เมื่อไม่กี่วันก่อน 
                         มังกรร้ายได้เข้าบุกทำร้ายผู้คนที่นี่ และยึดครองปราสาทเป็นของมัน`,
                        `คนมากมายถูกมันจับตัวไว้ที่นั่น ส่วนชาวบ้านบางคนที่เอาชีวิตรอดออกมาได้ ก็ต้องอพยพไปยังสถานที่อื่นที่ไกลออกไป`,
                        `ขอโทษด้วยนะ แต่ฉันมีความลับที่ยังไม่ได้บอกเธอ`,
                        `ใช่แล้ว ตัวจริงของฉันคือเจ้าหญิงคิวบี้ ธิดาองค์เดียวของราชาแห่งดินแดนนี้`,
                        `แต่ฉันไม่ได้ชอบชีวิตอย่างที่ฉันเป็นหรอก ฉันมักจะปลอมตัวเป็นคนธรรมดา 
                        แล้วออกไปผจญภัยในหมู่บ้านต่าง ๆ ทำให้ฉันได้พบกับเพื่อน ๆ ที่น่ารักของฉัน`,
                        `ตั้งแต่วันนั้น ฉันเสียใจและโกรธแค้นมังกรนั่นมาตลอด มังกรที่จับตัวท่านพระราชา.. 
                        มันจับตัวคุณพ่อของฉันไป (กำหมัด)`,
                        `แต่ทุกอย่างจะต้องจบลงวันนี้ เราจะไปพิชิตเจ้ามังกรนั่นกัน ฉันจะสอนทุกอย่างที่มีให้กับเธอเอง`
                    ]}
                    icon={[qubie,qubie,qubie,qubie,qubie,princess,princess,princess,princess]}
                />
        );
    }
}

export default Intro