import React from 'react';
import background from '@assets/explore/chapter5/backgroundQuiz.png';
import dragon from '@assets/explore/dragonIcon.png';
import princess from '@assets/explore/chapter5/princessIcon.png'
import king from '@assets/explore/chapter5/kingIcon.png'
import {F0,F1,F2,F3,F4,F5,F6,F7,F8,F9,F10,F11,F12,F13,F99,F100} from './Frame'
import { Iuser } from '../../../../type.modal'
import QuizTemplate from '../../Template/QuizTemplate'

class Quiz extends React.Component<{ setUser: any, user: Iuser }> {

    componentWillReceiveProps = () => {
        this.forceUpdate();
    }

    render() {
        return (
                <QuizTemplate
                    user={this.props.user}
                    setUser={this.props.setUser}
                    chapter={5}
                    frameComponent={[F0,F1,F2,F3,F4,F5,F5,F5,
                                    F6,F99,F7,F99,F8,F99,
                                    F9,F10,F11,F12,F12,F12,F12,F12,F12,F13,F100]}
                    interactFrame={[F6,F7,F8]} 
                    noDialogFrame={[F99,F100]}
                    script={[
                        `บ้าจริง เจ้าพวกนั้นมันเป็นใครกันแน่ ทำไมถึงได้แข็งแกร่งขนาดนั้น`,
                        `สภาพดูไม่ได้เลยนะ สมกับเป็นมังกรกระจอกจริง ๆ 
                        ถ้าเป็นแบบนี้ อีกไม่นานคงจะมีคนปราบแกได้แน่ ๆ `,
                        `ถูกขังอยู่แล้วยังจะทำปากเก่งอีกเหรอ สงสัยจะต้องจัดการแกก่อนซะแล้ว`,
                        `หยุดนะ!!`,
                        `ใครกัน!?`,
                        `คิวบี้ ! คิวบี้ลูกพ่อ`,
                        `ปล่อยตัวท่านพ่อของฉันเดี๋ยวนี้ ! แกไม่มีที่ให้หนีอีกแล้ว !`,
                        `นึกว่าใครที่ไหน ที่แท้ก็เจ้าพวกตัวป่วนที่คอยขัดขวางข้านี่เอง ! 
                        ตามสัญญาข้าจะใช้ทุกอย่างที่มีเพื่อจัดการพวกเจ้า`,
                        `ถ้าเจ้ารู้จักควอนตัมดีพอ เจ้าต้องรู้ว่าทำไมอัลกอริทึมทางควอนตัมจึงทำงานได้เร็วกว่าแบบดั้งเดิม`,
                        ``,
                        `นี่คือตารางแสดงเวลาที่ใช้เทียบกับจำนวนประตูของอัลกอริทึมทั้งสอง
                         แต่ข้าปรับมันจนผิดเพี้ยนไปแล้ว เจ้าจะแก้ให้มันถูกได้หรือไม่ `,
                        ``,
                        `แย่ล่ะสิ! จนมุมซะแล้ว! เห็นทีต้องหนีไปซ่อนตัวหลังประตูพวกนี้ก่อน
                        ถ้าเจ้าไม่เข้าใจการใช้งาน Grover's algorithm เจ้าก็คงจะหาข้าไม่เจอแน่นอน`,
                        ``,
                        `ไม่นะ ข้า.. ข้าแพ้แล้ววว`,
                        `เจ้ามังกรหมดฤทธิ์แล้ว ! พวกเราทำสำเร็จแล้ววว !!!`,
                        `ท่านพ่อ ! ลูกมาช่วยแล้ว `,
                        `โอ้ คิวบี้ลูกรัก และท่านคงเป็นผู้ที่ให้การช่วยเหลือคิวบี้มาโดยตลอด ข้าขอขอบคุณท่านมาก`,
                        `ขอขอบคุณเธอมากจริง ๆ เลยนะ ถ้าไม่ได้เธอช่วยปราบเจ้ามังกรร้าย พวกเราคงจะต้องแย่แน่ ๆ เท่านี้ทุกอย่างก็จบลงเสียที`,
                        `แย่แล้ว !! จริง ๆ แล้ว มังกรที่จับพ่อมา ไม่ใช่เจ้ามังกรอ้วนตัวนี้หรอกนะ แต่เป็นมังกรสีดำ ตัวใหญ่ยักษ์ และดุร้ายมาก นี่เป็นเพียงลูกน้องของมันเท่านั้น`,
                        `อะไรนะ !?`,
                        `หลังจากฟื้นฟูดินแดนของเรา เราจะจัดกองทัพเพื่อไปปราบมังกรร้ายนั่นให้สิ้นซาก ดินแดนของเราจะได้ไม่โดนพวกมันทำร้ายได้อีก`,
                        `เพราะอย่างนั้นแหละ ข้าอยากขอร้องให้ท่านผู้กล้าช่วยเหลือเราอีกสักครั้ง ร่วมมือกับพวกเราด้วยเถอะ เพื่อปกป้องดินแดนของพวกเรา`,
                        `ฉันก็ขอร้องอีกคน เธอไม่ต้องกังวลนะ ที่นี่มีสนามฝึกซ้อมที่เต็มไปด้วยอุปกรณ์และเครื่องมือครบครัน เธอสามารถเรียนรู้และทดลองวงจรควอนตัมและอัลกอริทึมต่าง ๆ ได้เต็มที่เลย`,
                        ``
                    ]}
                    icon={[dragon,king,dragon,princess,dragon,king,princess,dragon,
                            dragon,dragon,dragon,dragon,dragon,dragon,
                            dragon, princess, princess, king, princess, king, princess, king, king, princess]}
                    background={background}
                />
        );
    }
}

export default Quiz